import React from 'react';
import { Link } from 'react-router-dom';
import styles from "./Footer.module.css"

const Footer = () => {
    return (
        <div className={styles.container}>
            <div>
                <h1>Logo</h1>
                <button>بازگشت به بالا</button>
            </div>
            <div>
                <div>
                    <h3>باوک : همراه شما در روزهای دشوار</h3>
                    <h6>باوک یک وبسایت یاری دهنده بر پایه علم روانشناسی است که روی ارتباط شما عزیزان با روانشناسان و انتشار کلاس های ویدیـویی و پادکست ها و انواع رویداد های مربوطه متمرکز است. شما می توانید در دسته بندی های متنوعی مثل ورزش در خانه، روانشناسی، توسعه فردی، آشپزی و...، به آیتم های متنوعی دسترسی داشته باشید.</h6>
                    <h6>تلفن پشتیبانی:02632865344</h6>
                </div>
                <div>
                    <h3>لینک های باوک</h3>
                    <ul>
                        <li><a>تماس با ما</a></li>
                        <li><a>درباره ی باوک</a></li>
                        <li><a>قوانین استفاده و حریم شخصی</a></li>
                    </ul>
                </div>
                <div>
                    <h3>مجوزها</h3>
                    <div>
                        <h6>مجوز</h6>
                        <h6>مجوز</h6>
                        <h6>مجوز</h6>
                        <h6>مجوز</h6>
                    </div>
                </div>
                <div>
                    <h3>با ما همراه باشید</h3>
                    <h6>ایکون</h6>
                    <h6>ایکون</h6>
                    <h6>ایکون</h6>
                </div>
            </div>
        </div>
    );
};

export default Footer;